wei9A/controllers/LoginController.php

    public function actionIndex(){
        $request = YII::$app->request;
        if(!$request->post()){
            return $this->renderPartial('index');
        }else{
            //print_r($request->post());die;
            $u_name = $request->post('u_name');
            $pwd = md5($request->post('pwd'));
            $userData = User::find()->where(['uname'=>$u_name])->andWhere(['upwd'=>$pwd])->asArray()->one();
---
SELECT * FROM `wei_user` WHERE (`uname`='admin') AND (`upwd`='21232f297a57a5a743894a0e4a801fc3')