wei9A/controllers/PubnumController.php

SELECT * FROM `wei_publicnum`
INSERT INTO `wei_publicnum` (`appid`, `appname`, `appsecret`, `appdesc`, `appcheck`, `apptoken`, `appurl`, `uid`) VALUES ('wx92ac779ea9e5474b', 'aa', '2341417098ab7e58ed01fd90d4caa34d', 'aa', 'TB0aF', 'ecb47fbb07a752413640f82a945530f8', 'http://115.29.42.8/wei9A/wei.php?str=TB0aF', 2)
---
    public function actionAddnum(){
        $request = YII::$app->request;
        if(!$request->isPost){
            return $this->render('add');
        }else{
            $post = $request->post();
            $atok=$this->actionRands(5);

            $url=substr('http://'.$_SERVER['HTTP_HOST'].$_SERVER['REQUEST_URI'],0,strpos('http://'.$_SERVER['HTTP_HOST'].$_SERVER['REQUEST_URI'],'wei'))."wei9A/wei.php?str=".$atok;
            $pub = new Publicnum();
            $session = Yii::$app->session;
            $pub ->appid=$post['appid'];
            $pub ->appname= htmlspecialchars($post['appname']);
            $pub ->appsecret= htmlspecialchars($post['appsecret']);
            $pub ->appdesc=htmlspecialchars($post['appdesc']);
            $pub ->appcheck=$atok;
            $pub ->apptoken  =  md5(rand(1000,9999));
            $pub ->appurl=$url;
            $pub ->uid= $uid = $session->get('uid', '');
            if($pub ->save()){

SELECT * FROM `wei_publicnum`
---
    public function actionNumlist(){
        $data['numDate'] = Publicnum::find()->asArray()->all();

SELECT * FROM `wei_publicnum`
---
    public function actionNumdel()
    {
        if(!Publicnum::deleteAll(array('id'=>YII::$app->request->get('id')))){