wei9A/controllers/ReplyController.php

    public function actionIndex(){
        $db = \Yii::$app->db;
        $session = Yii::$app->session;
        $request = YII::$app->request;
        $uid = $session->get('uid', '');
        $data = Publicnum::find()->where("uid=$uid")->asArray()->all();
---
SELECT * FROM `wei_publicnum` WHERE uid=2

    public function actionAdd(){
        $session = Yii::$app->session;
        $request = YII::$app->request;
        $uid = $session->get('uid', '');
        if(!$request->isPost){
            $data = Publicnum::find()->where("uid=$uid")->asArray()->all();
---
SELECT * FROM `wei_publicnum` WHERE uid=2